In [1]:
import pymysql
import sqlalchemy as alch # python -m pip install --upgrade 'sqlalchemy<2.0'
from getpass import getpass
import pandas as pd
from getpass import getpass
import pandas as pd

In [2]:
password = getpass()

In [3]:
Sakila = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{Sakila}"
engine = alch.create_engine(connectionData)


query = "SELECT * FROM actor;"
pd.read_sql_query(query, engine)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

### 1. Calculate the average rental duration (in days) for each film:

In [17]:
query = """
SELECT film.title, film.rental_duration, AVG(DATEDIFF(rental.return_date,rental.rental_date)) AS Average
FROM film
JOIN inventory ON film.film_id = inventory.film_id
JOIN rental ON inventory.inventory_id = rental.inventory_id
GROUP BY film.title, film.rental_duration;
"""
df = pd.read_sql_query(query, engine)
df

                 title  rental_duration  Average
0     ACADEMY DINOSAUR                6   5.0909
1       ACE GOLDFINGER                3   5.6667
2     ADAPTATION HOLES                7   3.4167
3     AFFAIR PREJUDICE                5   4.7273
4          AFRICAN EGG                6   7.0909
..                 ...              ...      ...
953     YOUNG LANGUAGE                6   4.5714
954         YOUTH KICK                4   5.6667
955       ZHIVAGO CORE                6   5.8750
956  ZOOLANDER FICTION                5   5.5882
957          ZORRO ARK                3   4.5161

[958 rows x 3 columns]

#### Expected output

|title|rental_duration|avg_rental_duration|
|-----|---------------|-------------------|
|ACADEMY DINOSAUR|6              |4.9850             |
|ACE GOLDFINGER|3              |4.9850             |
|ADAPTATION HOLES|7              |4.9850             |
|AFFAIR PREJUDICE|5              |4.9850             |
|AFRICAN EGG|6              |4.9850             |
|AGENT TRUMAN|3              |4.9850             |
|AIRPLANE SIERRA|6              |4.9850             |
|AIRPORT POLLOCK|6              |4.9850             |
|ALABAMA DEVIL|3              |4.9850             |
|ALADDIN CALENDAR|6              |4.9850             |
|ALAMO VIDEOTAPE|6              |4.9850             |
|ALASKA PHANTOM|6              |4.9850             |
|ALI FOREVER|4              |4.9850             |
|ALICE FANTASIA|6              |4.9850             |

###  2. Calculate the average payment amount for each staff member:

In [21]:
query = """
SELECT staff_id, AVG(amount)
FROM payment
GROUP BY staff_id
"""
df = pd.read_sql_query(query, engine)
df

   staff_id  AVG(amount)
0         1     4.156568
1         2     4.245125

#### Expected output

|staff_id|avg_payment_amount|
|--------|------------------|
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |

<!-- ### 3. Calculate the total revenue for each customer, showing the running total within each customer's rental history: -->

### 3. Calculate the total revenue for each customer, showing the running total within each customer's rental history

In [30]:
query = """
SELECT rental.customer_id,rental.rental_id,rental.rental_date,payment.amount,SUM(payment.amount) OVER (PARTITION BY rental.customer_id ORDER BY rental.rental_date) AS running_total 
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
"""
df = pd.read_sql_query(query, engine)
df

       customer_id  rental_id         rental_date  amount  running_total
0                1         76 2005-05-25 11:30:37    2.99           2.99
1                1        573 2005-05-28 10:35:23    0.99           3.98
2                1       1185 2005-06-15 00:54:12    5.99           9.97
3                1       1422 2005-06-15 18:02:53    0.99          10.96
4                1       1476 2005-06-15 21:08:46    9.99          20.95
...            ...        ...                 ...     ...            ...
16039          599      14599 2005-08-21 17:43:42    4.99          66.85
16040          599      14719 2005-08-21 21:41:57    1.99          68.84
16041          599      15590 2005-08-23 06:09:44    8.99          77.83
16042          599      15719 2005-08-23 11:08:46    2.99          80.82
16043          599      15725 2005-08-23 11:25:00    2.99          83.81

[16044 rows x 5 columns]

#### Expected output

|customer_id|rental_id|rental_date        |amount|running_total|
|-----------|---------|-------------------|------|-------------|
|1          |76       |2005-05-25 11:30:37|2.99  |2.99         |
|1          |573      |2005-05-28 10:35:23|0.99  |3.98         |
|1          |1185     |2005-06-15 00:54:12|5.99  |9.97         |
|1          |1422     |2005-06-15 18:02:53|0.99  |10.96        |
|1          |1476     |2005-06-15 21:08:46|9.99  |20.95        |
|1          |1725     |2005-06-16 15:18:57|4.99  |25.94        |
|1          |2308     |2005-06-18 08:41:48|4.99  |30.93        |
|1          |2363     |2005-06-18 13:33:59|0.99  |31.92        |
|1          |3284     |2005-06-21 06:24:45|3.99  |35.91        |
|1          |4526     |2005-07-08 03:17:05|5.99  |41.90        |

### 4. Determine the quartile for the rental rates of films:

In [67]:
query = """
SELECT title, rental_rate, NTILE(4) OVER (ORDER BY rental_rate) AS quartile
FROM film
"""
df = pd.read_sql_query(query, engine)
df

                    title  rental_rate  quartile
0        ACADEMY DINOSAUR         0.99         1
1         ALAMO VIDEOTAPE         0.99         1
2          ALASKA PHANTOM         0.99         1
3          ALICE FANTASIA         0.99         1
4              ALONE TRIP         0.99         1
..                    ...          ...       ...
995  WONDERLAND CHRISTMAS         4.99         4
996   WORKING MICROCOSMOS         4.99         4
997         WYOMING STORM         4.99         4
998           YENTL IDAHO         4.99         4
999             ZORRO ARK         4.99         4

[1000 rows x 3 columns]

#### Expected output

|title|rental_rate|quartile           |
|-----|-----------|-------------------|
|ACADEMY DINOSAUR|0.99       |1                  |
|ALAMO VIDEOTAPE|0.99       |1                  |
|ALASKA PHANTOM|0.99       |1                  |
|ALICE FANTASIA|0.99       |1                  |
|ALONE TRIP|0.99       |1                  |
|ALTER VICTORY|0.99       |1                  |
|AMADEUS HOLY|0.99       |1                  |
|ANACONDA CONFESSIONS|0.99       |1                  |
|ANNIE IDENTITY|0.99       |1                  |
|ANONYMOUS HUMAN|0.99       |1                  |

### 5. Determine the first and last rental date for each customer:

In [31]:
query = """
SELECT customer_id, MIN(rental_date), MAX(rental_date)
FROM rental
GROUP BY customer_id
"""
df = pd.read_sql_query(query, engine)
df

     customer_id    MIN(rental_date)    MAX(rental_date)
0              1 2005-05-25 11:30:37 2005-08-22 20:03:46
1              2 2005-05-27 00:09:24 2005-08-23 17:39:35
2              3 2005-05-27 17:17:09 2005-08-23 07:10:14
3              4 2005-06-15 09:31:28 2005-08-23 07:43:00
4              5 2005-05-29 07:25:16 2006-02-14 15:16:03
..           ...                 ...                 ...
594          595 2005-05-28 15:27:22 2005-08-23 21:26:35
595          596 2005-05-26 21:16:52 2006-02-14 15:16:03
596          597 2005-05-25 04:19:28 2006-02-14 15:16:03
597          598 2005-06-20 10:10:29 2005-08-23 00:44:15
598          599 2005-05-31 01:18:56 2005-08-23 11:25:00

[599 rows x 3 columns]

#### Expected result

|customer_id|first_rental_date|last_rental_date   |
|-----------|-----------------|-------------------|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|

### 6. Calculate the rank of customers based on their rental counts:

In [33]:
query = """
SELECT customer_id, COUNT(rental_id) AS rental_count, RANK() OVER (ORDER BY COUNT(rental_id) DESC) AS rental_count_rank
FROM rental
GROUP BY customer_id
"""
df = pd.read_sql_query(query, engine)
df

     customer_id  rental_count  rental_count_rank
0            148            46                  1
1            526            45                  2
2            144            42                  3
3            236            42                  3
4             75            41                  5
..           ...           ...                ...
594          248            15                594
595           61            14                596
596          110            14                596
597          281            14                596
598          318            12                599

[599 rows x 3 columns]

#### Expected output

|customer_id|rental_count                 |rental_count_rank|
|-----------|-----------------------------|-----------------|
|148        |46                           |1                |
|526        |45                           |2                |
|144        |42                           |3                |
|236        |42                           |3                |
|75         |41                           |5                |
|197        |40                           |6                |
...|...|...

### 7. Calculate the running total of revenue per day for the 'Family' film category:

In [41]:
query = """
SELECT film.title, rental.rental_date, payment.amount, SUM(payment.amount) OVER (PARTITION BY rental.rental_date ORDER BY payment.amount ASC) AS daily_revenue 
FROM payment 
JOIN rental ON rental.rental_id = payment.rental_id
JOIN inventory ON  rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN film_category ON film.film_id = film_category.film_id
JOIN category ON film_category.category_id = category.category_id
WHERE category.name = 'Family'
"""
df = pd.read_sql_query(query, engine)
df

                      title         rental_date  amount  daily_revenue
0           BLANKET BEVERLY 2005-05-24 22:53:30    2.99           2.99
1            KING EVOLUTION 2005-05-25 00:22:55    6.99           6.99
2             APACHE DIVINE 2005-05-25 01:59:46    4.99           4.99
3        MANCHURIAN CURTAIN 2005-05-25 04:47:44    4.99           4.99
4               GANDHI KWAI 2005-05-25 13:52:43    0.99           0.99
...                     ...                 ...     ...            ...
1091        BLANKET BEVERLY 2006-02-14 15:16:03    2.99          19.92
1092          HALF OUTFIELD 2006-02-14 15:16:03    2.99          19.92
1093             JASON TRAP 2006-02-14 15:16:03    2.99          19.92
1094  CONVERSATION DOWNHILL 2006-02-14 15:16:03    4.99          29.90
1095      OPPOSITE NECKLACE 2006-02-14 15:16:03    4.99          29.90

[1096 rows x 4 columns]

#### Expected ouput

|film_category|rental_date                  |amount|daily_revenue|
|-------------|-----------------------------|------|-------------|
|BLANKET BEVERLY|2005-05-24 22:53:30          |2.99  |2.99         |
|GRADUATE LORD|2005-05-24 23:03:39          |3.99  |3.99         |
|LAWLESS VISION|2005-05-24 23:31:46          |4.99  |4.99         |
|HANGING DEEP |2005-05-25 00:02:21          |5.99  |5.99         |
|MONTEREY LABYRINTH|2005-05-25 00:31:15          |0.99  |0.99         |
|SCISSORHANDS SLUMS|2005-05-25 01:48:41          |2.99  |2.99         |
|EASY GLADIATOR|2005-05-25 03:41:50          |4.99  |4.99         |

### 8. Assign a unique ID to each payment within each customer's payment history:

In [54]:
query = """
SELECT customer_id,payment_id,COUNT(payment_id) OVER (PARTITION BY customer_id ORDER BY payment_id) AS payment_sequence_id
FROM payment 
"""
df = pd.read_sql_query(query, engine).head(33)
df

    customer_id  payment_id  payment_sequence_id
0             1           1                    1
1             1           2                    2
2             1           3                    3
3             1           4                    4
4             1           5                    5
5             1           6                    6
6             1           7                    7
7             1           8                    8
8             1           9                    9
9             1          10                   10
10            1          11                   11
11            1          12                   12
12            1          13                   13
13            1          14                   14
14            1          15                   15
15            1          16                   16
16            1          17                   17
17            1          18                   18
18            1          19                   19
19            1          20                   20
20            1          21                   21
21            1          22                   22
22            1          23                   23
23            1          24                   24
24            1          25                   25
25            1          26                   26
26            1          27                   27
27            1          28                   28
28            1          29                   29
29            1          30                   30
30            1          31                   31
31            1          32                   32
32            2          33                    1

|customer_id|payment_id|payment_sequence_id|
|-----------|----------|-------------------|
|1          |1         |1                  |
|1          |2         |2                  |
|1          |3         |3                  |
|1          |4         |4                  |
|1          |5         |5                  |
|1          |6         |6                  |
|1          |7         |7                  |
|1          |8         |8                  |
|1          |9         |9                  |
|1          |10        |10                 |
|1          |11        |11                 |
|1          |12        |12                 |
|1          |13        |13                 |
|1          |14        |14                 |
|1          |15        |15                 |
|1          |16        |16                 |
|1          |17        |17                 |
|1          |18        |18                 |
|1          |19        |19                 |
|1          |20        |20                 |
|1          |21        |21                 |
|1          |22        |22                 |
|1          |23        |23                 |
|1          |24        |24                 |
|1          |25        |25                 |
|1          |26        |26                 |
|1          |27        |27                 |
|1          |28        |28                 |
|1          |29        |29                 |
|1          |30        |30                 |
|1          |31        |31                 |
|1          |32        |32                 |
|2          |33        |1                  |
|2          |34        |2                  |
|2          |35        |3                  |
|2          |36        |4                  |
|2          |37        |5                  |
|2          |38        |6                  |
|2          |39        |7                  |
|2          |40        |8                  |
|2          |41        |9                  |
|2          |42        |10                 |
|2          |43        |11                 |
|2          |44        |12                 |

### 9. Calculate the difference in days between each rental and the previous rental for each customer:

In [62]:
query = """
SELECT customer_id, rental_id,rental_date, LAG(rental_date) OVER (ORDER BY customer_id,rental_id) AS previus_retal_date, DATEDIFF(rental_date, LAG(rental_date) OVER (ORDER BY customer_id)) AS days_between_rentals
FROM rental
"""
df = pd.read_sql_query(query, engine).head(33)
df

,customer_id,rental_id,rental_date,previus_retal_date,days_between_rentals
0,1,76,2005-05-25 11:30:37,NaT,NaN
1,1,573,2005-05-28 10:35:23,2005-05-25 11:30:37,3.0
2,1,1185,2005-06-15 00:54:12,2005-05-28 10:35:23,18.0
3,1,1422,2005-06-15 18:02:53,2005-06-15 00:54:12,0.0
4,1,1476,2005-06-15 21:08:46,2005-06-15 18:02:53,0.0
5,1,1725,2005-06-16 15:18:57,2005-06-15 21:08:46,1.0
6,1,2308,2005-06-18 08:41:48,2005-06-16 15:18:57,2.0
7,1,2363,2005-06-18 13:33:59,2005-06-18 08:41:48,0.0
8,1,3284,2005-06-21 06:24:45,2005-06-18 13:33:59,3.0
9,1,4526,2005-07-08 03:17:05,2005-06-21 06:24:45,17.0
10,1,4611,2005-07-08 07:33:56,2005-07-08 03:17:05,0.0
11,1,5244,2005-07-09 13:24:07,2005-07-08 07:33:56,1.0
12,1,5326,2005-07-09 16:38:01,2005-07-09 13:24:07,0.0
13,1,6163,2005-07-11 10:13:46,2005-07-09 16:38:01,2.0
14,1,7273,2005-07-27 11:31:22,2005-07-11 10:13:46,16.0
15,1,7841,2005-07-28 09:04:45,2005-07-27 11:31:22,1.0
16,1,8033,2005-07-28 16:18:23,2005-07-28 09:04:45,0.0
17,1,8074,2005-07-28 17:33:39,2005-07-28 16:18:23,0.0
18,1,8116,2005-07-28 19:20:07,2005-07-28 17:33:39,0.0
19,1,8326,2005-07-29 03:58:49,2005-07-28 19:20:07,1.0
20,1,9571,2005-07-31 02:42:18,2005-07-29 03:58:49,2.0
21,1,10437,2005-08-01 08:51:04,2005-07-31 02:42:18,1.0
22,1,11299,2005-08-02 15:36:52,2005-08-01 08:51:04,1.0
23,1,11367,2005-08-02 18:01:38,2005-08-02 15:36:52,0.0
24,1,11824,2005-08-17 12:37:54,2005-08-02 18:01:38,15.0
25,1,12250,2005-08-18 03:57:29,2005-08-17 12:37:54,1.0
26,1,13068,2005-08-19 09:55:16,2005-08-18 03:57:29,1.0
27,1,13176,2005-08-19 13:56:54,2005-08-19 09:55:16,0.0
28,1,14762,2005-08-21 23:33:57,2005-08-19 13:56:54,2.0
29,1,14825,2005-08-22 01:27:57,2005-08-21 23:33:57,1.0
30,1,15298,2005-08-22 19:41:37,2005-08-22 01:27:57,0.0
31,1,15315,2005-08-22 20:03:46,2005-08-22 19:41:37,0.0
32,2,320,2005-05-27 00:09:24,2005-08-22 20:03:46,-87.0

#### Expected output


|customer_id|rental_id|rental_date        |previous_rental_date|days_between_rentals|
|-----------|---------|-------------------|--------------------|--------------------|
|1          |76       |2005-05-25 11:30:37|NULL                |NULL                |
|1          |573      |2005-05-28 10:35:23|2005-05-25 11:30:37 |3                   |
|1          |1185     |2005-06-15 00:54:12|2005-05-28 10:35:23 |18                  |
|1          |1422     |2005-06-15 18:02:53|2005-06-15 00:54:12 |0                   |
|1          |1476     |2005-06-15 21:08:46|2005-06-15 18:02:53 |0                   |
|1          |1725     |2005-06-16 15:18:57|2005-06-15 21:08:46 |1                   |
|1          |2308     |2005-06-18 08:41:48|2005-06-16 15:18:57 |2                   |
|1          |2363     |2005-06-18 13:33:59|2005-06-18 08:41:48 |0                   |
|1          |3284     |2005-06-21 06:24:45|2005-06-18 13:33:59 |3                   |
|1          |4526     |2005-07-08 03:17:05|2005-06-21 06:24:45 |17                  |
|1          |4611     |2005-07-08 07:33:56|2005-07-08 03:17:05 |0                   |